<a href="https://colab.research.google.com/github/annapiotrowska404/Repozytorium-zdalne-1/blob/main/Pandas30_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import numpy as np
import pandas as pd

pd.__version__

'1.1.5'

In [7]:
s1 = pd.Series([1, 2, 3, 4,np.nan, 5, 6])
print(s1)
print(type(s1))

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    5.0
6    6.0
dtype: float64
<class 'pandas.core.series.Series'>

In [10]:
d1 = pd.DataFrame([[1,2], [3,4]])
print(d1)
print(type(d1))
print(type(d1[0]))

   0  1
0  1  2
1  3  4
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [12]:
d2 = pd.DataFrame(np.random.randn(7,3), index=[2013,2014,2015,2016,2017,2018,2019])
print(d2)

             0         1         2
2013  0.026857  1.373161 -0.801093
2014  0.402990  0.031592  0.167363
2015 -0.699742 -0.996189  0.689503
2016  1.462460 -0.414585 -0.081012
2017  0.771688  0.467865  0.109418
2018  0.850541  0.675173  0.746304
2019 -0.709086 -0.187873  0.539294

In [13]:
#tworzenie dat
dates = pd.date_range('20210130104900', periods=6)
print(dates)

DatetimeIndex(['2021-01-30 10:49:00', '2021-01-31 10:49:00',
               '2021-02-01 10:49:00', '2021-02-02 10:49:00',
               '2021-02-03 10:49:00', '2021-02-04 10:49:00'],
              dtype='datetime64[ns]', freq='D')

In [15]:
!git clone http://github.com/matzim95/ML-datasets

Cloning into 'ML-datasets'...
warning: redirecting to https://github.com/matzim95/ML-datasets/
remote: Enumerating objects: 71, done.
remote: Counting objects: 100% (71/71), done.
remote: Compressing objects: 100% (59/59), done.
remote: Total 71 (delta 16), reused 59 (delta 12), pack-reused 0
Unpacking objects: 100% (71/71), done.

In [18]:
from IPython.display import display
chipotle = pd.read_csv('ML-datasets/chipotle.tsv', sep='\t')
display(chipotle)

      order_id  ...  item_price
0            1  ...      $2.39
1            1  ...      $3.39
2            1  ...      $3.39
3            1  ...      $2.39
4            2  ...     $16.98
...        ...  ...         ...
4617      1833  ...     $11.75
4618      1833  ...     $11.75
4619      1834  ...     $11.25
4620      1834  ...      $8.75
4621      1834  ...      $8.75

[4622 rows x 5 columns]

In [29]:
chipotle.head()
chipotle.tail(2)
chipotle.sample(6)
chipotle.item_price
chipotle['item_price'] #równowazne
chipotle[['item_price', 'order_id']]
chipotle[53:54]
chipotle.index
chipotle.columns
chipotle.info()  #WAŻNE

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [42]:
#chipotle.loc[wiersze,kolumny]

chipotle.loc[50, 'quantity']
chipotle.loc[2:50:3, ['quantity', 'item_price']]
chipotle.iloc[2:50:3,[1,4]]
chipotle.loc[:,'quantity']

#powiększy wartość o 1
chipotle.iloc[2,1] = chipotle.iloc[2,1] + 1 
chipotle.iloc[2,1]

8

In [45]:
chipotle.quantity > 1  #zwraca True/False
chipotle[chipotle.quantity > 1]  #zwraca tylko te rekordy zgodne z warunkiem
len(chipotle[chipotle.quantity > 1])

268

In [47]:
chipotle.quantity = pd.Series(np.random.randint(3,6,4622))

In [53]:
chipotle['new'] = pd.Series(np.random.randint(1,1000,4622))

In [54]:
chipotle

      order_id  quantity  ... item_price  new
0            1       5.0  ...     $2.39   739
1            1       5.0  ...     $3.39   826
2            1       5.0  ...     $3.39   140
3            1       4.0  ...     $2.39   546
4            2       5.0  ...    $16.98   230
...        ...       ...  ...        ...  ...
4617      1833       5.0  ...    $11.75   427
4618      1833       5.0  ...    $11.75   891
4619      1834       4.0  ...    $11.25   106
4620      1834       5.0  ...     $8.75   160
4621      1834       NaN  ...     $8.75   861

[4622 rows x 6 columns]

In [156]:
cars = pd.read_csv('ML-datasets/auto_mpg.csv', na_values='?')
#cars.info()
cars.count()
cars.cylinders.count()
cars.cylinders.value_counts()
cars.weight.sum()
cars.weight.min()
cars.weight.max()
cars.max()
cars.horsepower.mean()
cars.horsepower.median()
cars.horsepower.std()

38.49115993282855

In [75]:
def func(x):
  return x.max() - x.min()

cars.apply(func)

cylinders          5.0
displacement     387.0
horsepower       184.0
weight          3527.0
acceleration      16.8
modelyear         12.0
origin             2.0
mpg               37.6
dtype: float64

In [76]:
cars.apply(lambda x: x.max() - x.min())

cylinders          5.0
displacement     387.0
horsepower       184.0
weight          3527.0
acceleration      16.8
modelyear         12.0
origin             2.0
mpg               37.6
dtype: float64

In [79]:
cars.groupby('cylinders').mean().horsepower
cars.groupby('modelyear').max()[['acceleration', 'weight']]

           acceleration  weight
modelyear
70                 20.5  4732.0
71                 20.5  5140.0
72                 23.5  4633.0
73                 21.0  4997.0
74                 21.0  4699.0
75                 21.0  4668.0
76                 22.2  4380.0
77                 19.0  4335.0
78                 21.5  4080.0
79                 24.8  4360.0
80                 23.7  3381.0
81                 20.7  3725.0
82                 24.6  3035.0

In [82]:
cars2 = cars.drop(0)
cars2

     cylinders  displacement  horsepower  ...  modelyear  origin   mpg
1            8         350.0       165.0  ...         70       1  15.0
2            8         318.0       150.0  ...         70       1  18.0
3            8         304.0       150.0  ...         70       1  16.0
4            8         302.0       140.0  ...         70       1  17.0
5            8         429.0       198.0  ...         70       1  15.0
..         ...           ...         ...  ...        ...     ...   ...
393          4         140.0        86.0  ...         82       1  27.0
394          4          97.0        52.0  ...         82       2  44.0
395          4         135.0        84.0  ...         82       1  32.0
396          4         120.0        79.0  ...         82       1  28.0
397          4         119.0        82.0  ...         82       1  31.0

[397 rows x 8 columns]

In [83]:
cars3 = cars.drop('origin', axis=1)
cars3

     cylinders  displacement  horsepower  weight  acceleration  modelyear   mpg
0            8         307.0       130.0  3504.0          12.0         70  18.0
1            8         350.0       165.0  3693.0          11.5         70  15.0
2            8         318.0       150.0  3436.0          11.0         70  18.0
3            8         304.0       150.0  3433.0          12.0         70  16.0
4            8         302.0       140.0  3449.0          10.5         70  17.0
..         ...           ...         ...     ...           ...        ...   ...
393          4         140.0        86.0  2790.0          15.6         82  27.0
394          4          97.0        52.0  2130.0          24.6         82  44.0
395          4         135.0        84.0  2295.0          11.6         82  32.0
396          4         120.0        79.0  2625.0          18.6         82  28.0
397          4         119.0        82.0  2720.0          19.4         82  31.0

[398 rows x 7 columns]

In [84]:
print(cars.info())
cars = cars.dropna()
print(cars.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cylinders     398 non-null    int64
 1   displacement  398 non-null    float64
 2   horsepower    392 non-null    float64
 3   weight        398 non-null    float64
 4   acceleration  398 non-null    float64
 5   modelyear     398 non-null    int64
 6   origin        398 non-null    int64
 7   mpg           398 non-null    float64
dtypes: float64(5), int64(3)
memory usage: 25.0 KB
None
<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cylinders     392 non-null    int64
 1   displacement  392 non-null    float64
 2   horsepower    392 non-null    float64
 3   weight        392 non-null    float64
 4   acceleration  392 non-null    float64
 5   modelyear     392 non-null    int64
 6   origin        392 non-null    int64
 7   mpg           392 non-null    float64
dtypes: float64(5), int64(3)
memory usage: 27.6 KB
None

In [85]:
zoo = pd.read_csv('ML-datasets/zoo.csv')
zoo

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [92]:
#zoo = zoo.append({'animal': 'tiger', 'uniq_id': 1023, 'water_need': 350}, ignore_index=True)

zoo_eats = pd.DataFrame({'animal':['elephant', 'tiger', 'zebra', 'giraffe', 'kangaroo'],
                         'food':['vegetables', 'meat', 'vegetables', 'vegetables', 'vegetables']})
zoo_eats

     animal        food
0  elephant  vegetables
1     tiger        meat
2     zebra  vegetables
3   giraffe  vegetables
4  kangaroo  vegetables

In [97]:
zoo.merge(zoo_eats, how='outer') #inner, outer, left, right

      animal  uniq_id  water_need        food
0   elephant   1001.0       500.0  vegetables
1   elephant   1002.0       600.0  vegetables
2   elephant   1003.0       550.0  vegetables
3      tiger   1004.0       300.0        meat
4      tiger   1005.0       320.0        meat
5      tiger   1006.0       330.0        meat
6      tiger   1007.0       290.0        meat
7      tiger   1008.0       310.0        meat
8      tiger   1023.0       350.0        meat
9      tiger   1023.0       350.0        meat
10     zebra   1009.0       200.0  vegetables
11     zebra   1010.0       220.0  vegetables
12     zebra   1011.0       240.0  vegetables
13     zebra   1012.0       230.0  vegetables
14     zebra   1013.0       220.0  vegetables
15     zebra   1014.0       100.0  vegetables
16     zebra   1015.0        80.0  vegetables
17      lion   1016.0       420.0         NaN
18      lion   1017.0       600.0         NaN
19      lion   1018.0       500.0         NaN
20      lion   1019.0       390.0         NaN
21  kangaroo   1020.0       410.0  vegetables
22  kangaroo   1021.0       430.0  vegetables
23  kangaroo   1022.0       410.0  vegetables
24   giraffe      NaN         NaN  vegetables

In [102]:
cars.sort_values(['cylinders'])
#cars.sort_values(by=['cylinders'], ascending=False).reset_index(drop=True)
cars.sort_values(by=['cylinders', 'horsepower'], ascending=[False, True]).reset_index(drop=True)

     cylinders  displacement  horsepower  ...  modelyear  origin   mpg
0            8         260.0        90.0  ...         79       1  23.9
1            8         350.0       105.0  ...         81       1  26.6
2            8         262.0       110.0  ...         75       1  20.0
3            8         260.0       110.0  ...         77       1  17.0
4            8         260.0       110.0  ...         78       1  19.9
..         ...           ...         ...  ...        ...     ...   ...
387          4         121.0       115.0  ...         78       2  21.6
388          3          70.0        90.0  ...         73       3  18.0
389          3          70.0        97.0  ...         72       3  19.0
390          3          70.0       100.0  ...         80       3  23.7
391          3          80.0       110.0  ...         77       3  21.5

[392 rows x 8 columns]

In [105]:
zoo2 = zoo.merge(zoo_eats, how='left')
zoo2.food = zoo2.food.fillna('meat')

zoo2

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         320        meat
5      tiger     1006         330        meat
6      tiger     1007         290        meat
7      tiger     1008         310        meat
8      zebra     1009         200  vegetables
9      zebra     1010         220  vegetables
10     zebra     1011         240  vegetables
11     zebra     1012         230  vegetables
12     zebra     1013         220  vegetables
13     zebra     1014         100  vegetables
14     zebra     1015          80  vegetables
15      lion     1016         420        meat
16      lion     1017         600        meat
17      lion     1018         500        meat
18      lion     1019         390        meat
19  kangaroo     1020         410  vegetables
20  kangaroo     1021         430  vegetables
21  kangaroo     1022         410  vegetables
22     tiger     1023         350        meat
23     tiger     1023         350        meat

In [111]:
dates = pd.DataFrame({'date':[20210129,20210130,20210131]})
#dates.info()
dates.date = pd.to_datetime(dates.date, format='%Y%m%d')
#dates.info()
dates.date.dt.year
dates.date.dt.month
dates.date.dt.day
dates.date.dt.day_name()

0      Friday
1    Saturday
2      Sunday
Name: date, dtype: object

In [122]:
dolarizer = lambda x: float(x[1:])
chipotle.item_price = chipotle.item_price.apply(dolarizer)

TypeError: ignored

In [123]:
chipotle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4621 non-null   float64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   float64
 5   new                 4622 non-null   int64
dtypes: float64(2), int64(2), object(2)
memory usage: 216.8+ KB

In [124]:
chipotle.groupby('order_id').sum().item_price.mean()

18.81142857142869

In [128]:
chipotle.groupby('item_name').sum().quantity.sort_values(ascending=False)

item_name
Chicken Bowl                             2887.0
Chicken Burrito                          2218.0
Chips and Guacamole                      1910.0
Steak Burrito                            1517.0
Canned Soft Drink                        1209.0
Steak Bowl                                852.0
Chips                                     836.0
Bottled Water                             646.0
Chicken Soft Tacos                        463.0
Chips and Fresh Tomato Salsa              452.0
Chicken Salad Bowl                        440.0
Canned Soda                               424.0
Side of Chips                             413.0
Veggie Burrito                            381.0
Barbacoa Burrito                          360.0
Veggie Bowl                               350.0
Barbacoa Bowl                             266.0
Carnitas Bowl                             262.0
Carnitas Burrito                          237.0
Steak Soft Tacos                          223.0
6 Pack Soft Drink                         213.0
Chips and Tomatillo Red Chili Salsa       194.0
Chips and Tomatillo Green Chili Salsa     178.0
Chicken Crispy Tacos                      174.0
Carnitas Soft Tacos                       152.0
Steak Crispy Tacos                        146.0
Chips and Tomatillo-Green Chili Salsa     126.0
Steak Salad Bowl                          110.0
Nantucket Nectar                          109.0
Barbacoa Soft Tacos                       100.0
Chips and Roasted Chili Corn Salsa         90.0
Chips and Tomatillo-Red Chili Salsa        81.0
Izze                                       81.0
Chips and Roasted Chili-Corn Salsa         75.0
Veggie Salad Bowl                          75.0
Barbacoa Crispy Tacos                      47.0
Barbacoa Salad Bowl                        41.0
Chicken Salad                              34.0
Veggie Soft Tacos                          28.0
Carnitas Crispy Tacos                      27.0
Burrito                                    25.0
Carnitas Salad Bowl                        25.0
Veggie Salad                               23.0
Steak Salad                                15.0
Salad                                       8.0
Bowl                                        8.0
Crispy Tacos                                8.0
Veggie Crispy Tacos                         5.0
Chips and Mild Fresh Tomato Salsa           4.0
Carnitas Salad                              4.0
Name: quantity, dtype: float64

In [129]:
chipotle.groupby('choice_description').sum().quantity.sort_values(ascending=False)

choice_description
[Diet Coke]                                                                                                            526.0
[Coke]                                                                                                                 513.0
[Sprite]                                                                                                               303.0
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese, Sour Cream, Lettuce]]                                                 172.0
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese, Sour Cream, Guacamole, Lettuce]]                                      158.0
                                                                                                                       ...
[Tomatillo-Green Chili Salsa (Medium), [Black Beans, Rice, Fajita Veggies, Cheese, Sour Cream, Guacamole, Lettuce]]      3.0
[Fresh Tomato Salsa, [Pinto Beans, Cheese, Sour Cream, Guacamole, Fajita Vegetables, Rice, Black Beans, Lettuce]]        3.0
[Fresh Tomato Salsa, [Lettuce, Sour Cream, Cheese, Fajita Vegetables, Pinto Beans, Rice]]                                3.0
[Fresh Tomato Salsa, [Lettuce, Fajita Vegetables, Guacamole, Rice, Black Beans]]                                         3.0
[Fresh Tomato Salsa, [Pinto Beans, Cheese, Sour Cream, Lettuce]]                                                         3.0
Name: quantity, Length: 1043, dtype: float64

In [130]:
chipotle.quantity.sum()

18552.0

In [134]:
#zysk cały
revenue = (chipotle.quantity * chipotle.item_price).sum()
round(revenue, 1)

138312.0

In [135]:
#średni zysk ze zlecenia
chipotle['revenue'] = chipotle.quantity * chipotle.item_price
chipotle.groupby('order_id').sum().revenue.mean()

75.41550708833172

In [138]:
#liczba sprzedawanych produktów
chipotle.item_name.value_counts().count()

50

In [139]:
#ile produktów kosztuje > 10$
chipotle[chipotle.item_price>10].item_name.value_counts().count()

31

In [140]:
chipotle[chipotle.item_price>10].max()

order_id                   1834
quantity                      5
item_name     Veggie Soft Tacos
item_price                44.25
new                         999
revenue                     135
dtype: object

In [141]:
chipotle[(chipotle.item_name == 'Chicken Bowl') & (chipotle.quantity == 3)].item_price

5       10.98
26       8.49
209     11.25
211     11.25
224      8.75
        ...
4555     8.75
4574     8.75
4581     8.75
4586    11.25
4604     8.75
Name: item_price, Length: 247, dtype: float64

In [142]:
#jak czesto sałatka
salad = chipotle[chipotle.item_name == 'Veggie Salad']
len(salad)

6

In [145]:
drinks = pd.read_csv('ML-datasets/drinks.csv')
drinks

         country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0    Afghanistan              0  ...                           0.0         AS
1        Albania             89  ...                           4.9         EU
2        Algeria             25  ...                           0.7         AF
3        Andorra            245  ...                          12.4         EU
4         Angola            217  ...                           5.9         AF
..           ...            ...  ...                           ...        ...
188    Venezuela            333  ...                           7.7         SA
189      Vietnam            111  ...                           2.0         AS
190        Yemen              6  ...                           0.1         AS
191       Zambia             32  ...                           2.5         AF
192     Zimbabwe             64  ...                           4.7         AF

[193 rows x 6 columns]

In [146]:
drinks[drinks.country == 'Poland']

    country  beer_servings  ...  total_litres_of_pure_alcohol  continent
135  Poland            343  ...                          10.9         EU

[1 rows x 6 columns]

In [147]:
drinks.groupby('continent').mean().total_litres_of_pure_alcohol

continent
AF    3.007547
AS    2.170455
EU    8.617778
OC    3.381250
SA    6.308333
Name: total_litres_of_pure_alcohol, dtype: float64

In [148]:
drinks.groupby('continent').describe().wine_servings

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

In [149]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [150]:
drinks[drinks.country == 'USA']

    country  beer_servings  ...  total_litres_of_pure_alcohol  continent
184     USA            249  ...                           8.7        NaN

[1 rows x 6 columns]

In [152]:
drinks.continent = drinks.continent.fillna('unknown')
drinks.groupby('continent').mean()

           beer_servings  ...  total_litres_of_pure_alcohol
continent                 ...
AF             61.471698  ...                      3.007547
AS             37.045455  ...                      2.170455
EU            193.777778  ...                      8.617778
OC             89.687500  ...                      3.381250
SA            175.083333  ...                      6.308333
unknown       145.434783  ...                      5.995652

[6 rows x 4 columns]

In [153]:
drinks.groupby('continent').agg(['max', 'min', 'sum']).spirit_servings

           max  min   sum
continent
AF         152    0   866
AS         326    0  2677
EU         373    0  5965
OC         254    0   935
SA         302   25  1377
unknown    438   68  3812

In [155]:
drinks[(drinks.continent == 'EU') & (drinks.total_litres_of_pure_alcohol == 0)]

        country  beer_servings  ...  total_litres_of_pure_alcohol  continent
111      Monaco              0  ...                           0.0         EU
147  San Marino              0  ...                           0.0         EU

[2 rows x 6 columns]

In [162]:
cars = pd.read_csv('ML-datasets/auto_mpg.csv', na_values='?')
#cars.info()
means = cars.groupby('cylinders').mean().horsepower

for i in range(3,7):
  cars.horsepower[cars.cylinders == i] = cars.horsepower[cars.cylinders == i].fillna(means[i])

cars.horsepower[cars.cylinders == 8] = cars.horsepower[cars.cylinders == 8].fillna(means[8])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy